---
type: CombinableElement
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# CombinableElement

`Autodesk.Revit.DB.CombinableElement` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Combinations | — | `public GeomCombinationSet Combinations { get ; }` |
| Property | Parameter | — | `` |